Revit 2027 API
ReferenceWithContext.GetInstanceTransform Method
 Gets the transform of the instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetInstanceTransform()
Public Function GetInstanceTransform As Transform
public:
Transform^ GetInstanceTransform()
member GetInstanceTransform : unit -> Transform
Return Value
Transform
 The transform of an instance when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
See Also
Reference
ReferenceWithContext Class
Autodesk.Revit.DB Namespace